DELETE FROM user_roles;
DELETE FROM meals;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password) VALUES
  ('User', 'user@yandex.ru', 'password'),
  ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id) VALUES
  ('ROLE_USER', 100000),
  ('ROLE_ADMIN', 100001);

INSERT INTO meals (user_id, date_time, description, calories) VALUES
  (100000, '2020-06-21 09:10:00', 'Завтрак', 400),
  (100000, '2020-06-21 13:20:00', 'Обед', 800),
  (100000, '2020-06-21 21:30:00', 'Ужин', 600),
  (100000, '2020-06-21 17:23:01', 'Перекус', 300),
  (100000, '2020-06-22 08:30:00', 'Завтрак', 300),
  (100000, '2020-06-22 12:35:10', 'Обед', 800),
  (100000, '2020-06-21 19:35:50', 'Ужин', 500),

  (100001, '2020-06-21 08:10:00', 'Завтрак', 400),
  (100001, '2020-06-21 12:20:00', 'Обед', 800),
  (100001, '2020-06-21 20:30:00', 'Ужин', 600),
  (100001, '2020-06-21 18:23:01', 'Перекус', 300),
  (100001, '2020-06-22 09:30:00', 'Завтрак', 300),
  (100001, '2020-06-22 13:35:10', 'Обед', 800),
  (100001, '2020-06-21 20:15:50', 'Ужин', 500);
